# StdPostedWarning Class

---
Support for Reviewable Warnings sent from AddOn.
SystemObject Autodesk.Revit.DBStdPostedWarning
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class StdPostedWarning : IDisposable

    Public Class StdPostedWarning
    	Implements IDisposable

    public ref class StdPostedWarning : IDisposable

    type StdPostedWarning =
        class
            interface IDisposable
        end
The StdPostedWarning type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the StdPostedWarning
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
Used to create and send Reviewable Warning from AddOn.
#### Reference
Autodesk.Revit.DB Namespace